
## :white_check_mark: Apply Succeeded

[CI link](https://github.com/hayas1/tfgh/actions/runs/11840313425)



<pre><code>Apply complete! Resources: 1 added, 1 changed, 2 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
github_issue_label.update-snippets: Refreshing state... [id=tfgh:update-snippets]
module.repositories["devcontainer-features"].github_repository.this: Refreshing state... [id=devcontainer-features]
module.repositories["tfgh"].github_repository.this: Refreshing state... [id=tfgh]
module.repositories["dyson-rs"].github_repository.this: Refreshing state... [id=dyson-rs]
module.repositories["dyson-rs"].github_branch.default: Refreshing state... [id=dyson-rs:master]
module.repositories["devcontainer-features"].github_repository_ruleset.this: Refreshing state... [id=2602488]
module.repositories["dyson-rs"].github_repository_ruleset.this: Refreshing state... [id=2589508]
module.repositories["tfgh"].github_branch.default: Refreshing state... [id=tfgh:main]
module.repositories["devcontainer-features"].github_branch.default: Refreshing state... [id=devcontainer-features:main]
module.repositories["tfgh"].github_issue_label.this["refactor"]: Refreshing state... [id=tfgh:refactor]
module.repositories["devcontainer-features"].github_issue_label.this["maintenance"]: Refreshing state... [id=devcontainer-features:maintenance]
module.repositories["tfgh"].github_issue_label.this["deps"]: Refreshing state... [id=tfgh:deps]
module.repositories["dyson-rs"].github_issue_label.this["maintenance"]: Refreshing state... [id=dyson-rs:maintenance]
module.repositories["tfgh"].github_repository_ruleset.this: Refreshing state... [id=2558597]
module.repositories["dyson-rs"].github_issue_label.this["refactor"]: Refreshing state... [id=dyson-rs:refactor]
module.repositories["devcontainer-features"].github_issue_label.this["feature"]: Refreshing state... [id=devcontainer-features:feature]
module.repositories["devcontainer-features"].github_issue_label.this["refactor"]: Refreshing state... [id=devcontainer-features:refactor]
module.repositories["dyson-rs"].github_issue_label.this["deps"]: Refreshing state... [id=dyson-rs:deps]
module.repositories["dyson-rs"].github_issue_label.this["feature"]: Refreshing state... [id=dyson-rs:feature]
module.repositories["tfgh"].github_issue_label.this["bugfix"]: Refreshing state... [id=tfgh:bugfix]
module.repositories["tfgh"].github_issue_label.this["documentation"]: Refreshing state... [id=tfgh:documentation]
module.repositories["devcontainer-features"].github_issue_label.this["breaking"]: Refreshing state... [id=devcontainer-features:breaking]
module.repositories["devcontainer-features"].github_issue_label.this["documentation"]: Refreshing state... [id=devcontainer-features:documentation]
module.repositories["devcontainer-features"].github_issue_label.this["deps"]: Refreshing state... [id=devcontainer-features:deps]
module.repositories["dyson-rs"].github_issue_label.this["documentation"]: Refreshing state... [id=dyson-rs:documentation]
module.repositories["tfgh"].github_issue_label.this["breaking"]: Refreshing state... [id=tfgh:breaking]
module.repositories["devcontainer-features"].github_issue_label.this["bugfix"]: Refreshing state... [id=devcontainer-features:bugfix]
module.repositories["tfgh"].github_issue_label.this["maintenance"]: Refreshing state... [id=tfgh:maintenance]
module.repositories["dyson-rs"].github_issue_label.this["bugfix"]: Refreshing state... [id=dyson-rs:bugfix]
module.repositories["dyson-rs"].github_issue_label.this["breaking"]: Refreshing state... [id=dyson-rs:breaking]
module.repositories["tfgh"].github_issue_label.this["feature"]: Refreshing state... [id=tfgh:feature]
module.repositories["tfgh"].github_branch_default.this: Refreshing state... [id=tfgh]
module.repositories["devcontainer-features"].github_branch_default.this: Refreshing state... [id=devcontainer-features]
module.repositories["dyson-rs"].github_branch_default.this: Refreshing state... [id=dyson-rs]
module.repositories["tfgh"].github_branch.managed: Refreshing state... [id=tfgh:chore/managed-by-terraform]
module.repositories["devcontainer-features"].github_branch.managed: Refreshing state... [id=devcontainer-features:chore/managed-by-terraform]
module.repositories["dyson-rs"].github_branch.managed: Refreshing state... [id=dyson-rs:chore/managed-by-terraform]
module.repositories["tfgh"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=tfgh/.github/release.yml]
module.repositories["dyson-rs"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=dyson-rs/.github/labeler.yml]
module.repositories["tfgh"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=tfgh/.github/labeler.yml]
module.repositories["devcontainer-features"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=devcontainer-features/.github/workflows/labeler.yml]
module.repositories["devcontainer-features"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=devcontainer-features/.github/release.yml]
module.repositories["dyson-rs"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=dyson-rs/.github/pull_request_template.md]
module.repositories["devcontainer-features"].github_repository_file.this["github/labeler.yml"]: Refreshing state... [id=devcontainer-features/.github/labeler.yml]
module.repositories["devcontainer-features"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=devcontainer-features/.github/issue_template.md]
module.repositories["tfgh"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=tfgh/.github/workflows/labeler.yml]
module.repositories["tfgh"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=tfgh/.github/issue_template.md]
module.repositories["dyson-rs"].github_repository_file.this["github/workflows/labeler.yml"]: Refreshing state... [id=dyson-rs/.github/workflows/labeler.yml]
module.repositories["devcontainer-features"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=devcontainer-features/.github/pull_request_template.md]
module.repositories["tfgh"].github_repository_file.this["github/pull_request_template.md"]: Refreshing state... [id=tfgh/.github/pull_request_template.md]
module.repositories["dyson-rs"].github_repository_file.this["github/release.yml"]: Refreshing state... [id=dyson-rs/.github/release.yml]
module.repositories["dyson-rs"].github_repository_file.this["github/issue_template.md"]: Refreshing state... [id=dyson-rs/.github/issue_template.md]
module.repositories["dyson-rs"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:dyson-rs:9]
module.repositories["tfgh"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:tfgh:59]
module.repositories["devcontainer-features"].github_repository_pull_request.managed: Refreshing state... [id=hayas1:devcontainer-features:42]
github_repository_environment.apply: Refreshing state... [id=tfgh:apply]
github_issue_label.manual: Refreshing state... [id=tfgh:manual]
github_repository_environment.plan: Refreshing state... [id=tfgh:plan]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.repositories["devcontainer-features"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"6dc52c8dea42db6f1adb11018e708101cd424abff23232d6886285458a9c97f6\"" -> "W/\"19ae9a7125c8647ef5d93fed50cc4cedaaa225aec8fe85aa82f0d05bc1ec0ee7\""
        id                          = "devcontainer-features"
        name                        = "devcontainer-features"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repositories["dyson-rs"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"79e06c30efb6fcfeb13756b51df946179a4f682e0197a8d0a9fa3fe6a92d925c\"" -> "W/\"865c96a3d6400da1c63c534dde0bb10473295f38f028185564acfb9c3f1bbf53\""
        id                          = "dyson-rs"
        name                        = "dyson-rs"
        # (35 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repositories["tfgh"].github_repository.this has changed
  ~ resource "github_repository" "this" {
      ~ etag                        = "W/\"531ca4c2a1c77f6d6eb236fcbf9f64105a36b3424b3cdedff813dd913b4556d8\"" -> "W/\"b0b6c5320d5ce112d147784e666c2bb9e83faf816121f8b446ab474e9bdd5fd3\""
        id                          = "tfgh"
        name                        = "tfgh"
        # (35 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # github_issue_label.update-snippets will be destroyed
  # (because github_issue_label.update-snippets is not in configuration)
  - resource "github_issue_label" "update-snippets" {
      - color       = "E9C4AA" -> null
      - description = "Replace pull request managed by terraform" -> null
      - etag        = "W/\"78ed634c7982ab3fb0bd02ec9787da31281d19bade77e2bb56004dec92edf5d9\"" -> null
      - id          = "tfgh:update-snippets" -> null
      - name        = "update-snippets" -> null
      - repository  = "tfgh" -> null
      - url         = "https://api.github.com/repos/hayas1/tfgh/labels/update-snippets" -> null
    }

  # module.repositories["tfgh"].github_repository_file.this["github/labeler.yml"] will be updated in-place
  ~ resource "github_repository_file" "this" {
      ~ content                         = <<-EOT
            feature:
              - head-branch:
                - '^feat/'
                - '^feature/'
            
            breaking:
              - head-branch:
                - '^breaking/'
            
            bugfix:
              - head-branch:
                - '^fix/'
                - '^bugfix/'
                - '^modify/'
            
            refactor:
              - head-branch:
                - '^refactor/'
            
            documentation:
              - changed-files:
                - any-glob-to-any-file:
                  - '**/README.md'
              - head-branch:
                - '^doc/'
                - '^docs/'
                - '^documentation/'
            
            deps:
              - head-branch:
                - '^dep/'
                - '^deps/'
                - '^dependencies/'
            
            maintenance:
              - changed-files:
                - any-glob-to-any-file:
                  - '.github/**'
              - head-branch:
                - '^maintenance/'
                - '^ci/'
                - '^workflow/'
                - '^chore/'
          - 
          - update-snippets:
          -   - changed-files:
          -     - any-glob-to-any-file:
          -       - 'terraform/module/repository/github/**'
          -       - 'terraform/additional/**'
        EOT
        id                              = "tfgh/.github/labeler.yml"
        # (10 unchanged attributes hidden)
    }

  # module.repositories["tfgh"].github_repository_pull_request.managed will be replaced due to changes in replace_triggered_by
-/+ resource "github_repository_pull_request" "managed" {
      ~ base_sha              = "8150f61bf5d62aeff025c77c3c712d6ac6dac26c" -> (known after apply)
      ~ draft                 = false -> (known after apply)
      ~ head_sha              = "61efa6e9365a25fdf3cdd71f562022240c7a05ac" -> (known after apply)
      ~ id                    = "hayas1:tfgh:59" -> (known after apply)
      ~ labels                = [
          - "no-changes",
          - "manual",
        ] -> (known after apply)
      ~ number                = 59 -> (known after apply)
      ~ opened_at             = 1731427164 -> (known after apply)
      ~ opened_by             = "hayas1" -> (known after apply)
      ~ state                 = "closed" -> (known after apply)
      ~ updated_at            = 1731513886 -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 2 to destroy.
github_issue_label.update-snippets: Destroying... [id=tfgh:update-snippets]
github_issue_label.update-snippets: Destruction complete after 0s
module.repositories["tfgh"].github_repository_pull_request.managed: Destroying... [id=hayas1:tfgh:59]
module.repositories["tfgh"].github_repository_pull_request.managed: Destruction complete after 0s
module.repositories["tfgh"].github_repository_file.this["github/labeler.yml"]: Modifying... [id=tfgh/.github/labeler.yml]
module.repositories["tfgh"].github_repository_file.this["github/labeler.yml"]: Modifications complete after 3s [id=tfgh/.github/labeler.yml]
module.repositories["tfgh"].github_repository_pull_request.managed: Creating...
module.repositories["tfgh"].github_repository_pull_request.managed: Creation complete after 2s [id=hayas1:tfgh:65]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 1 added, 1 changed, 2 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform","PRNumber":64,"Program":"tfcmt","SHA1":"8120c226c32c74ee896e9eec444d8844adbb17b7","Vars":{},"WorkflowName":"Terraform apply on push"} -->